[
    {
        "filename": "resume.pdf",
        "description": "Resume of Troy, a data engineer / software engineer by trade with a background in Computer Science and Mathematics.",
        "priority": 1
    },
    {
        "filename": "photos/pups.jpg",
        "description": "A photo of Troy's dogs that he shares with his husband Kayden (from left to right): Benji (a shepherd mix), Freckles (aussie doodle), and Charlie (husky).",
        "priority": 4
    },
    {
        "filename": "TAMU_research/Active-Routing Presentation.pdf",
        "description": "Troy's presentation on his research on Active Routing in 3D memory cubes as part of the Undergraduate Research Scholars Program at Texas A&M University in 2019-2020. This Active-Routing poster was printed and hung at a University-wide event, where Troy presented his findings to satisfy his University Honors obligations.",
        "priority": 2
    },
    {
        "filename": "TAMU_research/Proposal.pdf",
        "description": "Troy's proposal for his research on Active Routing in 3D memory cubes as part of the Undergraduate Research Scholars Program at Texas A&M University in 2019-2020. This document outlines the objectives, methodology, and expected outcomes of the experiments in his research.",
        "semantic": true,
        "priority": 2
    },
    {
        "filename": "TAMU_ESET/ESET_369_Term_Project.pdf",
        "description": "For Troy's ESET (Embedded Systems Integration) Minor, he completed a term project that involved creating a web-hosted game of pong using a serially-communicated potentiometer with a TI Mixed-Signal Microcontroller (MCU) and an Arduino UNO. This was a very hardware heavy project involving more low-level code in C and incorporating concepts from embedded systems, such as serial communication and hardware interfacing.",
        "semantic": true,
        "priority": 3
    },
    {
        "filename": "photos/PUCP.jpg",
        "description": "A photo from Troy's study abroad class at Pontificia Universidad Católica del Perú (PUCP) in Lima, Peru. He studied abroad there in the summer of 2019 taking an Engineering Ethics course while traveling around the country.",
        "semantic": true,
        "priority": 4
    },
    {
        "filename": "TAMU_Reverse_SE/CTF.pdf",
        "description": "Troy's presentation on Capture The Flag (CTF) competitions from a fun software reverse engineering class taken at Texas A&M University as part of his major in Computer Science.",
        "semantic": true,
        "priority": 3
    },
    {
        "filename": "TAMU_Reverse_SE/Windows Heap Exploits.pptx",
        "description": "Troy's presentation on Windows Heap Exploits for legacy systems from a fun software reverse engineering class taken at Texas A&M University as part of his major in Computer Science.",
        "semantic": true,
        "priority": 3
    },
    {
        "filename": "Misc/SpaceCRAFT_World_Design.pptx",
        "description": "Troy's presentation on SpaceCRAFT \"World Design.\" This team/group project developed VR simulations for data-driven terrains, including the Moon and the planetary bodies in the Solar System. It was presented at the 2017 Texas A&M University Engineering Project Showcase during Troy's freshman year.",
        "semantic": true,
        "priority": 3
    },
    {
        "filename": "Computer_Science/MovieMash.pdf",
        "description": "Troy's technical report on \"MovieMash\", a web application that allows users to schedule a movie marathon based on matched terms and structured metadata in a search engine (Elasticsearch) based on iMDb data. This was a team/group project completed for a Computer Science course at Texas A&M University.",
        "semantic": true,
        "priority": 2
    },
    {
        "filename": "photos/me.jpg",
        "description": "A professional headshot photo of Troy.",
        "semantic": true,
        "priority": 4
    },
    {
        "filename": "photos/family.JPG",
        "description": "A photo of Troy and his family, including his husband Kayden, and their dogs Benji, Freckles, and Charlie.",
        "semantic": true,
        "priority": 4
    },
    {
        "filename": "Aspen/about.txt",
        "description": "A retrospective on Troy's time at Aspen Insights, an AI startup in Fort Worth, Texas, where he has worked as a director since 2020.",
        "semantic": false,
        "priority": 2
    }
]